[
  {
    "id": 1,
    "name": "Daffodil",
    "category": "Flowering",
    "description": "The Daffodil is a beautiful spring-blooming flower with trumpet-shaped petals that come in various shades of yellow and white. These cheerful flowers symbolize renewal and hope, making them a popular choice for gardens and floral arrangements. Daffodils are easy to care for and thrive in well-drained soil and partial sunlight.",
    "price": 10.99,
    "stock": 20,
    "scientificName": "Narcissus",
    "url": "Images/Flowers/Flowering/Daffodil.jpg",
    "careInstructions": "Plant daffodil bulbs in the fall, about 6 inches deep and 4-6 inches apart. Water moderately and provide sunlight for optimal growth. After blooming, allow the foliage to wither naturally.",
    "wateringRequirements": "Moderate",
    "originCountry": "Europe and North Africa"
  },
  {
    "id": 2,
    "name": "Dahlia",
    "category": "Flowering",
    "description": "Dahlias are known for their striking and colorful flowers, which can vary in petal shape from single to fully double. With an array of hues, including reds, pinks, oranges, and purples, Dahlias add a vibrant touch to gardens and floral arrangements. These plants thrive in well-drained soil and require regular deadheading to encourage continuous blooming.",
    "price": 8.75,
    "stock": 15,
    "scientificName": "Dahlia",
    "url": "Images/Flowers/Flowering/Dahlia.jpg",
    "careInstructions": "Plant dahlia tubers in spring after the last frost. Provide support as they grow tall. Water deeply and regularly to keep the soil consistently moist. Mulching helps retain moisture and control weeds.",
    "wateringRequirements": "Regular",
    "originCountry": "Central America, Mexico, and Colombia"
  },
  {
    "id": 3,
    "name": "Iris",
    "category": "Flowering",
    "description": "The Iris is an elegant flowering plant known for its distinctive sword-like leaves and intricate flowers that come in a variety of colors. Irises thrive in well-drained soil and can be found in gardens, borders, and even water features. Regular division of rhizomes helps maintain their vigor and blooming.",
    "price": 12.5,
    "stock": 25,
    "scientificName": "Iris",
    "url": "Images/Flowers/Flowering/Iris.jpg",
    "careInstructions": "Plant iris rhizomes just below the soil surface, ensuring good drainage. Water consistently until established. After flowering, cut back flower stalks and remove dead leaves. Divide overcrowded clumps every few years.",
    "wateringRequirements": "Regular",
    "originCountry": "Europe, North America, and Asia"
  },
  {
    "id": 4,
    "name": "Jasmine",
    "category": "Flowering",
    "description": "Jasmine is prized for its fragrant white flowers that release a sweet and enchanting scent, especially in the evening. These climbing vines are often used to cover walls, trellises, and arbors, creating a romantic atmosphere. Jasmine prefers full sunlight and well-drained soil.",
    "price": 7.99,
    "stock": 18,
    "scientificName": "Jasminum",
    "url": "Images/Flowers/Flowering/Jassmine.jpg",
    "careInstructions": "Plant jasmine in a location with plenty of sunlight and support for climbing. Keep the soil consistently moist but not waterlogged. Prune after flowering to maintain shape and encourage new growth.",
    "wateringRequirements": "Regular",
    "originCountry": "Tropical and subtropical regions of Eurasia, Australasia, and Oceania"
  },
  {
    "id": 5,
    "name": "Marigold",
    "category": "Flowering",
    "description": "Marigolds are vibrant and versatile flowers often used for both decorative and medicinal purposes. With their bright orange and yellow hues, they add a cheerful touch to gardens and landscapes. Marigolds thrive in well-drained soil and can tolerate heat and drought.",
    "price": 6.49,
    "stock": 30,
    "scientificName": "Tagetes",
    "url": "Images/Flowers/Flowering/Marigold.jpg",
    "careInstructions": "Plant marigolds in well-drained soil with good air circulation. Water moderately, allowing the soil to dry between waterings. Deadhead spent flowers to promote continuous blooming. Marigolds can deter pests in vegetable gardens.",
    "wateringRequirements": "Moderate",
    "originCountry": "Mexico and Central America"
  },
  {
    "id": 6,
    "name": "Tulip",
    "category": "Flowering",
    "description": "Tulips are iconic spring flowers that come in a wide range of colors and shapes. They create a stunning display in gardens, flowerbeds, and even containers. Tulips prefer well-drained soil and require a period of cold dormancy to bloom.",
    "price": 9.25,
    "stock": 12,
    "scientificName": "Tulipa",
    "url": "Images/Flowers/Flowering/Tulip.jpg",
    "careInstructions": "Plant tulip bulbs in the fall, at a depth of about 6-8 inches. Choose a location with full sunlight. Water after planting and again when shoots emerge in spring. Allow foliage to wither naturally before removing.",
    "wateringRequirements": "Regular",
    "originCountry": "Central Asia, Turkey, and Iran"
  },
  {
    "id": 7,
    "name": "Begonia",
    "category": "Outdoor",
    "description": "Begonias are popular foliage and flowering plants often grown as ornamentals. With their lush leaves and bright flowers, they bring color to shaded areas and containers. Begonias prefer well-drained soil and protection from harsh sunlight.",
    "price": 5.75,
    "stock": 22,
    "scientificName": "Begonia",
    "url": "Images/Flowers/Outdoor/Begonia.jpg",
    "careInstructions": "Plant begonias in rich, well-drained soil with indirect sunlight. Water when the top inch of soil feels dry. Fertilize regularly during the growing season. Pinch back leggy growth to encourage bushier plants.",
    "wateringRequirements": "Moderate",
    "originCountry": "Tropical and subtropical regions worldwide"
  },
  {
    "id": 8,
    "name": "Bougainvillea",
    "category": "Outdoor",
    "description": "Bougainvillea is a vibrant and hardy plant known for its colorful bracts that surround small white flowers. It's often used to create a tropical atmosphere in gardens and landscapes. Bougainvillea thrives in full sunlight and well-drained soil.",
    "price": 14.99,
    "stock": 28,
    "scientificName": "Bougainvillea",
    "url": "Images/Flowers/Outdoor/Bougainvillea.jpg",
    "careInstructions": "Plant bougainvillea in a location with full sunlight and support for climbing. Water deeply and allow the soil to dry between waterings. Prune to shape the plant after each flowering cycle.",
    "wateringRequirements": "Low",
    "originCountry": "South America"
  },
  {
    "id": 9,
    "name": "Cactus",
    "category": "Outdoor",
    "description": "Cacti are a diverse group of succulent plants known for their water-storing abilities, making them well-suited for arid climates. They come in various shapes and sizes, adding a unique and low-maintenance touch to gardens and xeriscapes.",
    "price": 3.99,
    "stock": 8,
    "scientificName": "Cactaceae",
    "url": "Images/Flowers/Outdoor/Cactus.jpg",
    "careInstructions": "Plant cacti in well-drained soil with good drainage. Water sparingly, allowing the soil to dry completely between waterings. Provide ample sunlight. Protect from frost during colder months.",
    "wateringRequirements": "Low",
    "originCountry": "Americas"
  },
  {
    "id": 10,
    "name": "Caladium",
    "category": "Outdoor",
    "description": "Caladiums are colorful foliage plants often used for landscaping and adding a tropical touch to gardens. Their large, heart-shaped leaves come in a variety of shades, including green, pink, and red. Caladiums prefer well-drained soil and partial to full shade.",
    "price": 11.25,
    "stock": 14,
    "scientificName": "Caladium",
    "url": "Images/Flowers/Outdoor/Caladium.jpg",
    "careInstructions": "Plant caladium tubers in well-drained soil with indirect sunlight. Water regularly to keep the soil consistently moist. Mulching helps retain moisture and suppress weeds. Protect from strong sunlight to prevent leaf scorch.",
    "wateringRequirements": "Regular",
    "originCountry": "South America and Central America"
  },
  {
    "id": 11,
    "name": "Lavender",
    "category": "Outdoor",
    "description": "Lavender is a fragrant herb with aromatic purple flowers that are not only beautiful but also have culinary and medicinal uses. Lavender plants thrive in well-drained soil and require full sunlight to encourage robust growth and abundant flowering.",
    "price": 9.99,
    "stock": 20,
    "scientificName": "Lavandula",
    "url": "Images/Flowers/Outdoor/Lavendar.jpg",
    "careInstructions": "Plant lavender in well-drained soil with excellent drainage. Water sparingly once established, allowing the soil to dry between waterings. Prune after flowering to maintain shape and encourage new growth. Harvest flowers for various uses.",
    "wateringRequirements": "Low",
    "originCountry": "Mediterranean region, Africa, and Asia"
  },
  {
    "id": 12,
    "name": "Rose",
    "category": "Outdoor",
    "description": "Roses are classic and beloved flowering shrubs that come in a wide range of colors and varieties. Their elegant blooms and fragrance make them a staple in gardens around the world. Roses require well-drained soil and regular care, including pruning and feeding.",
    "price": 16.5,
    "stock": 18,
    "scientificName": "Rosa",
    "url": "Images/Flowers/Outdoor/Rose.jpg",
    "careInstructions": "Plant roses in well-amended, well-drained soil with full sunlight. Water deeply and consistently, keeping the soil evenly moist. Prune dead or diseased wood regularly. Fertilize during the growing season for optimal blooming.",
    "wateringRequirements": "Regular",
    "originCountry": "Various"
  },
  {
    "id": 13,
    "name": "Common Hibiscus",
    "category": "Shrubs",
    "description": "Common Hibiscus is known for its showy flowers in various colors, often used to create a tropical vibe in gardens and landscapes. These shrubs thrive in warm climates and require regular pruning and care to maintain their shape and blooming.",
    "price": 7.25,
    "stock": 22,
    "scientificName": "Hibiscus rosa-sinensis",
    "url": "Images/Flowers/Shrubs/CommonHibiscus.jpg",
    "careInstructions": "Plant hibiscus in well-drained soil with good sunlight exposure. Water consistently to keep the soil moist. Prune after flowering to encourage new growth and shape the plant. Protect from strong winds and frost.",
    "wateringRequirements": "Regular",
    "originCountry": "Tropical and subtropical regions"
  },
  {
    "id": 14,
    "name": "Highbush Blueberry",
    "category": "Shrubs",
    "description": "Highbush Blueberry is a berry-producing shrub known for its delicious and nutritious fruits. These shrubs thrive in acidic soil and require proper care, including pruning, mulching, and protection from birds during fruiting.",
    "price": 13.75,
    "stock": 16,
    "scientificName": "Vaccinium corymbosum",
    "url": "Images/Flowers/Shrubs/HighbushBlueberry.jpg",
    "careInstructions": "Plant blueberries in well-drained, acidic soil. Provide full sunlight and consistent moisture. Mulch to retain soil moisture and suppress weeds. Prune to shape the plant and remove dead wood. Netting may be needed to protect berries from birds.",
    "wateringRequirements": "Regular",
    "originCountry": "North America"
  },
  {
    "id": 15,
    "name": "Lingonberry",
    "category": "Shrubs",
    "description": "Lingonberry is a small shrub known for its small red berries that are often used in jams, desserts, and as a culinary ingredient. These shrubs require well-drained soil and protection from harsh winter conditions.",
    "price": 5.99,
    "stock": 24,
    "scientificName": "Vaccinium vitis-idaea",
    "url": "Images/Flowers/Shrubs/Lingonberry.jpg",
    "careInstructions": "Plant lingonberries in well-drained soil with partial sunlight. Water consistently to keep the soil evenly moist. Mulch to protect roots and retain moisture. Prune to remove old or diseased branches and encourage new growth.",
    "wateringRequirements": "Regular",
    "originCountry": "Northern Hemisphere"
  },
  {
    "id": 16,
    "name": "Mountain-laurel",
    "category": "Shrubs",
    "description": "Mountain-laurel is an evergreen shrub known for its beautiful clusters of flowers that bloom in spring. These shrubs thrive in acidic and well-drained soil, and they make an attractive addition to woodland gardens and natural landscapes.",
    "price": 11.49,
    "stock": 10,
    "scientificName": "Kalmia latifolia",
    "url": "Images/Flowers/Shrubs/MountainLaurel.jpg",
    "careInstructions": "Plant mountain-laurel in well-drained, acidic soil with filtered sunlight. Water regularly during the growing season to maintain consistent moisture. Mulch to conserve soil moisture and suppress weeds. Prune after flowering to shape the plant.",
    "wateringRequirements": "Regular",
    "originCountry": "Eastern North America"
  },
  {
    "id": 17,
    "name": "Oleander",
    "category": "Shrubs",
    "description": "Oleander is an ornamental shrub known for its toxic but striking flowers that come in various colors. These shrubs are drought-tolerant once established and can be used as hedges or specimen plants.",
    "price": 8.99,
    "stock": 15,
    "scientificName": "Nerium oleander",
    "url": "Images/Flowers/Shrubs/Oleander.jpg",
    "careInstructions": "Plant oleander in well-drained soil with full sunlight. Water regularly until established. Prune to shape the plant and remove spent flowers. Keep away from livestock and pets due to its toxicity.",
    "wateringRequirements": "Low",
    "originCountry": "Mediterranean region, Asia"
  },
  {
    "id": 18,
    "name": "Red Raspberry",
    "category": "Shrubs",
    "description": "Red Raspberry is a delicious and nutritious berry-producing shrub known for its flavorful fruits. These shrubs thrive in well-drained soil and require proper care, including pruning, trellising, and protection from pests.",
    "price": 6.85,
    "stock": 12,
    "scientificName": "Rubus idaeus",
    "url": "Images/Flowers/Shrubs/RedRaspberry.jpg",
    "careInstructions": "Plant red raspberries in well-drained soil with full sunlight. Provide support with a trellis for climbing canes. Water consistently to keep the soil evenly moist. Prune to remove dead canes and encourage new growth.",
    "wateringRequirements": "Regular",
    "originCountry": "Europe and northern Asia"
  },
  {
    "id": 19,
    "name": "Aloe humilis",
    "category": "Succulents",
    "description": "Aloe humilis is a small succulent with rosettes of spiky leaves. It's a hardy plant that adds texture to succulent gardens and arrangements. Aloe humilis is easy to care for and thrives in well-drained soil and bright sunlight.",
    "price": 4.25,
    "stock": 30,
    "scientificName": "Aloe humilis",
    "url": "Images/Flowers/Succulents/AloeHumilis.jpg",
    "careInstructions": "Plant aloe humilis in well-drained succulent soil with good drainage. Water sparingly, allowing the soil to dry out between waterings. Provide bright sunlight, but protect from intense midday sun. Avoid overwatering to prevent root rot.",
    "wateringRequirements": "Low",
    "originCountry": "Africa"
  },
  {
    "id": 20,
    "name": "Aloe vera",
    "category": "Succulents",
    "description": "Aloe vera is a medicinal succulent known for its gel-filled leaves that have soothing and healing properties. This versatile plant can be grown indoors and outdoors, requiring well-drained soil and bright but indirect sunlight.",
    "price": 7.5,
    "stock": 25,
    "scientificName": "Aloe vera",
    "url": "Images/Flowers/Succulents/AloeVera.jpg",
    "careInstructions": "Plant aloe vera in a well-draining succulent mix. Water deeply but infrequently, allowing the soil to dry between waterings. Place in bright, indirect sunlight. Harvest leaves for aloe gel as needed, cutting close to the base.",
    "wateringRequirements": "Low",
    "originCountry": "Arabian Peninsula"
  },
  {
    "id": 21,
    "name": "Dracaena trifasciata",
    "category": "Succulents",
    "description": "Dracaena trifasciata, commonly known as Snake Plant or Mother-in-law's Tongue, is a popular houseplant with upright variegated leaves. It's known for its air-purifying qualities and low maintenance needs.",
    "price": 5.99,
    "stock": 18,
    "scientificName": "Dracaena trifasciata",
    "url": "Images/Flowers/Succulents/DracaenaTrifasciata.jpg",
    "careInstructions": "Plant snake plant in well-drained soil with indirect light. Water sparingly, allowing the soil to dry between waterings. Snake plants are tolerant of low light conditions and can go weeks without water.",
    "wateringRequirements": "Low",
    "originCountry": "West Africa"
  },
  {
    "id": 22,
    "name": "Echeveria",
    "category": "Succulents",
    "description": "Echeveria is a rosette-shaped succulent with colorful leaves. It's a popular choice for succulent gardens and arrangements. Echeverias thrive in well-drained soil and bright sunlight.",
    "price": 3.75,
    "stock": 20,
    "scientificName": "Echeveria",
    "url": "Images/Flowers/Succulents/Echeveria.jpg",
    "careInstructions": "Plant echeveria in well-drained succulent mix with good drainage. Water sparingly, allowing the soil to dry out between waterings. Provide bright sunlight, but protect from intense afternoon sun. Remove dead leaves to encourage new growth.",
    "wateringRequirements": "Low",
    "originCountry": "Americas"
  },
  {
    "id": 23,
    "name": "Jade Plant",
    "category": "Succulents",
    "description": "Jade Plant is a hardy succulent with thick, fleshy leaves that store water. It's often considered a symbol of good luck and prosperity. Jade plants thrive in well-drained soil and bright sunlight.",
    "price": 6.5,
    "stock": 15,
    "scientificName": "Crassula ovata",
    "url": "Images/Flowers/Succulents/JadePlant.jpg",
    "careInstructions": "Plant jade plant in well-drained succulent mix with bright, indirect light. Water sparingly, allowing the soil to dry between waterings. Jade plants prefer cooler temperatures at night. Prune to maintain shape and encourage bushier growth.",
    "wateringRequirements": "Low",
    "originCountry": "South Africa"
  },
  {
    "id": 24,
    "name": "Coral Cactus",
    "category": "Succulents",
    "description": "Rhipsalis cereuscula is a unique trailing succulent with cylindrical stems. It's an intriguing addition to hanging baskets and elevated planters. Rhipsalis cereuscula thrives in well-draining soil and prefers bright but indirect light.",
    "price": 12.25,
    "stock": 10,
    "scientificName": "Rhipsalis cereuscula",
    "url": "Images/Flowers/Succulents/RhipsalisCereuscula.jpg",
    "careInstructions": "Plant Rhipsalis cereuscula in a hanging basket with well-draining succulent mix. Water when the top inch of soil is dry. Provide bright but filtered sunlight to prevent scorching. Fertilize during the growing season for best results.",
    "wateringRequirements": "Low",
    "originCountry": "South America"
  }
]
